Repository: 84000/data-translation-memory
Catalog: toh195_84000-the-avalokini-sutra.tmx
Source language: bo
Languages: en

source: །དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས།
en: “Through those roots of virtue,

source: །མཁས་པ་བག་ཡོད་གྱུར་ནས་ནི།
en: This wise man will act conscientiously.

source: །དེ་བཞིན་གཤེགས་པ་མཉེས་བྱས་ཏེ།
en: He will please the thus-gone ones,

source: །རྐང་གཉིས་མཆོག་ལ་མཆོད་པ་བྱེད།
en: And worship these supreme ones among humans.

source: །མཆོད་རྟེན་ཕྲེང་བ་འབུལ་བྱེད་པ། །དེ་ནི་འདོད་ཆགས་མི་འཕྲོགས་ཤིང་།
en: “Whoever offers a garland to a stūpa

source: །ཞེ་སྡང་གིས་ཀྱང་འཕྲོགས་མི་འགྱུར།
en: Will never be carried away By desire or anger,

source: །དེ་ནི་ནམས་ཀྱང་རྨོངས་མི་འགྱུར།
en: Nor will he become deluded.

source: །རྐང་གཉིས་མཆོག་ལ་མཆོད་བྱས་ན།
en: “Whoever worships the supreme ones among humans

source: །དེ་ནི་ཚེ་རབས་ཐམས་ཅད་དུ།
en: Will, throughout all his lives, Keep his senses under control,

source: །ཆགས་པ་མེད་ཅིང་ཞེ་སྡང་མེད། །བརྐམ་པ་མེད་ཅིང་དབང་པོ་བསྡམས།
en: And be free from attachment, aversion, and craving.

source: །མཆོད་རྟེན་ཕྲེང་བ་འབུལ་བྱེད་པ།
en: “Whoever offers a garland to a stūpa Will always be respected,

source: །ཚེ་རབས་བྱེ་བ་སྟོང་རྣམས་དང་། །ཁྲག་ཁྲིག་དག་ནི་བརྒྱ་བགྲངས་པ། །ཀུན་ཏུ་བཀུར་སྟི་བྱས་པར་འགྱུར།
en: For lives numbered in The billions and trillions.

source: །དེ་ནི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར།
en: Will become a universal monarch,

source: །བརྒྱ་བྱིན་ལྷ་ཡི་དབང་ཕྱུག་འགྱུར།
en: Śakra, lord of the gods,

source: །ཚངས་པའི་འཇིག་རྟེན་ཚངས་པར་འགྱུར།
en: And Brahmā, ruling over the Brahmā world. “Having offered silken brocades

source: །འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ལ། །དར་གྱི་དབུལ་བ་ཕུལ་བྱས་ནས།
en: To the protectors and refuges of the world,

source: །ལྷ་ཡི་དག་དང་མི་རྣམས་ཀྱི།
en: All his divine and human goals

source: །དོན་རྣམས་ཐམས་ཅད་འགྲུབ་པར་འགྱུར།
en: Will be accomplished. “He will never again be reborn

source: །དམའ་བའི་རིགས་ནི་རྣམ་སྤངས་ཏེ། །དེར་ནི་དེ་སྐྱེ་འགྱུར་མ་ཡིན།
en: In inferior families.

source: །ཕྱུག་ཅིང་ནོར་ཆེན་ལྡན་པ་དང་། །འཇིག་རྟེན་དབང་ཕྱུག་དེ་འགྱུར་རོ།
en: He will be rich and prosperous, And will become a powerful lord of the world.

source: །དེ་བཞིན་གཤེགས་ལ་མཆོད་བྱས་ན།
en: “If someone worships the thus-gone ones,

source: །གཟུགས་དང་དོན་དང་ལོངས་སྤྱོད་དང་། །ཁ་དོག་དང་ནི་འབྱོར་པ་དང་། །ཀུན་ཏུ་གྲགས་དང་ལྡན་པར་འགྱུར།
en: He will have a perfect physical appearance, His goals will be accomplished, and he will possess Enjoyments, good looks, wealth, and fame.

source: །དེ་ནི་ཚེ་རབས་དྲན་འགྱུར་ཞིང་།
en: “Throughout all his lives, he will be mindful,

source: །འདོད་ཆགས་ཀྱིས་ཀྱང་འཕྲོགས་མི་འགྱུར།
en: And will never be carried away by attachment.

source: །འདོད་པ་རྣམས་ཀྱི་སྐྱོན་ཤེས་ཤིང་།
en: Understanding the shortcomings of lust,

source: །ཚངས་པར་སྤྱད་པ་སྤྱོད་པར་འགྱུར།
en: He will engage in pure conduct.

source: །དེ་བཞིན་གཤེགས་པ་མཆོད་བྱས་ན།
en: “Whoever worships the thus-gone ones

source: །གཟུགས་རྣམས་དང་ནི་སྒྲ་དག་དང་། །རོ་རྣམས་ཀྱིས་ཀྱང་མི་ཚུགས་ཤིང་།
en: Will not be affected By forms, sounds, or tastes,

source: །སྡིག་པའི་ལས་ནི་བྱེད་མི་འགྱུར།
en: And will not engage in negative actions.

source: །རྣམ་པར་འདྲེན་པ་མཆོད་བྱེད་ན།
en: “Whoever worships the guides

source: །དེ་ནི་སྤོས་དང་མེ་ཏོག་གིས། །ནམས་ཀྱང་ཕོངས་པར་མི་འགྱུར་ཞིང་།
en: Will never be short of perfumes and flowers,

source: །དྲན་ལྡན་ཤེས་རབ་ལྡན་པར་འགྱུར།
en: And will be endowed With mindfulness and insight.

source: །དེ་བཞིན་གཤེགས་ལ་སུ་མཆོད་པ། །དེ་ཡི་ནོར་གྱི་ཕུང་པོ་ལ།
en: “Whoever worships the thus-gone ones

source: །རྒྱལ་པོ་དང་ནི་ཆོམ་རྐུན་དང་། །མེ་དང་ཆུས་ཀྱང་རེག་མི་འགྱུར།
en: Will never have his wealth touched By kings, thieves, Fire, or water. “Whoever offers silken brocades

source: །འཇིག་རྟེན་མགོན་པོའི་མཆོད་རྟེན་ལ། །དར་གྱི་དབུལ་བ་སུ་འབུལ་བ།
en: To the stūpa of a protector of the world

source: །དེ་ནི་སྐམ་དང་མྱ་ངན་དང་། །ནད་བུ་ཅན་དུ་གཞར་མི་འགྱུར།
en: Will never encounter drought, Sorrow, or sickness.

source: །འཇིག་རྟེན་སྒྲོན་མ་མཆོད་བྱེད་པ།
en: “Whoever worships the lights of the world

source: །མྱ་ངན་མེད་ཅིང་གནོད་མེད་དང་། །འཁོར་ལོས་སྒྱུར་བ་འབྱོར་ཆེན་འགྱུར།
en: Be free from sorrow and harm, And will become a wealthy universal monarch.

source: །འདྲེན་ལ་མཆོད་པ་བྱས་ན་ནི།
en: “Whoever worships the guides

source: །རྐང་པ་ལག་པ་མཉེན་འགྱུར་ཞིང་།
en: Will have flexible legs and arms;

source: །ཡན་ལག་རྣམ་པར་དགའ་གྱུར་ལ།
en: He will have flawless limbs,

source: །གཟུགས་དང་ཁ་དོག་ལྡན་པར་འགྱུར།
en: Good looks, and a beautiful appearance.

source: །སྡིག་པའི་ལས་ནི་རྣམ་སྤངས་ཏེ།
en: “Having abandoned negative actions,

source: །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པར་བྱེད།
en: He will engage in bodhisattva conduct, And will meet the supreme ones among humans,

source: །གང་དག་འཇིག་རྟེན་རབ་དཀོན་པ། །རྐང་གཉིས་མཆོག་རྣམས་མཐོང་བར་འགྱུར།
en: Who are so rare to find in the world.

source: །བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་དང་། །ཁྲག་ཁྲིག་དག་ནི་བརྒྱ་བགྲངས་པར།
en: “For billions and trillions of eons,

source: །མཆོད་ཅིང་བདེ་ལ་ཤེས་རབ་ལྡན།
en: He will worship, Be happy and wise,

source: །བྱང་ཆུབ་དམ་པ་འཚང་ཡང་རྒྱ།
en: And awaken to sublime buddhahood. “Whoever builds a house with garlands

source: །འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ལ། །ཕྲེང་བའི་ཁང་པ་བྱས་ན་ནི། །དེ་ནི་གཡོག་འཁོར་མི་ཕྱེད་ཅིང་།
en: For the protectors and refuges of the world

source: །རྒྱལ་པོ་འབྱོར་པ་ཆེན་པོར་འགྱུར།
en: Will become a wealthy king, Never separated from his servants and attendants. “He will abandon the negative actions

source: །འཕགས་པ་རྣམས་ཀྱིས་གང་སྤངས་པ།
en: That have been abandoned by the noble ones,

source: །སྡིག་པའི་ལས་ནི་སྤོང་བར་བྱེད།
en: And rely on the virtuous actions

source: །རྫོགས་སངས་རྒྱས་ཀྱིས་བཤད་པ་ཡི།
en: Prescribed by the perfect buddhas. “He will be loved, cherished,

source: །དགེ་བའི་ལས་ལ་སྟེན་པར་བྱེད།
en: Honored, and praised

source: །ལྷ་འམ་འོན་ཏེ་ཀླུ་རྣམས་སམ།
en: By the gods, nāgas,

source: །འཇིག་རྟེན་དག་ན་གང་མཁས་པ། །དེ་དག་དགའ་ཞིང་མགུ་བ་དང་། །བསྟི་སྟང་བྱས་ཤིང་བསྔགས་པར་འགྱུར།
en: And wise ones in the world.

source: །བརྟན་པ་དེ་ནི་གར་སྐྱེས་པ།
en: “Wherever this steadfast one is born,

source: །བསོད་ནམས་གཟི་བརྗིད་རབ་ཏུ་བརྗིད།
en: The brilliance of his merit will be resplendent.

source: །ཡུལ་འཁོར་དག་དང་གྲོང་ཁྱེར་དང་། །རིགས་དེར་བསྟི་སྟང་བྱེད་པར་འགྱུར།
en: His land, city, And family will all honor him.

source: །སངས་རྒྱས་གཞན་གྱིས་མི་ཐུབ་པ།
en: “Whoever worships the unassailable buddhas,

source: །རྐང་གཉིས་མཆོག་ལ་སུ་མཆོད་པ།
en: The supreme ones among humans,

source: །དེ་དག་མཐུ་སྟོབས་ཆེ་བ་དང་། །གཡོག་འཁོར་ཆེན་པོས་མཛེས་པར་འགྱུར། །བྱང་ཆུབ་ཏུ་ནི་ཡོངས་བསྔོས་ཏེ།
en: Will be strong and powerful, And will enjoy a great retinue of servants.

source: །ཕྲེང་བའི་གཙུག་ལག་ཁང་བྱས་ན།
en: “Whoever builds a monastery with garlands

source: །སངས་རྒྱས་རྣམས་ཀྱིས་གང་བསྔགས་པའི།
en: And dedicates it to awakening

source: །འབྱོར་པ་དག་ནི་དེས་འཐོབ་བོ།
en: Will obtain thereby the riches Praised by the buddhas.

source: །དེ་ནི་འཐེང་དང་ཞར་བ་དང་། །དམན་དང་མ་རུངས་མི་འགྱུར་གནས།
en: “He will not be crippled or blind, Or inferior or base.

source: །གང་དང་གང་དུ་སྐྱེས་པར་ཡང་།
en: Wherever that person is born,

source: །མཚན་རྣམས་ཀྱིས་ནི་བརྒྱན་པར་འགྱུར།
en: His body will be adorned with the marks.

source: །སེམས་ཅན་དབུལ་པོ་རྣམས་མཐོང་ན།
en: “Upon seeing destitute beings,

source: །དེ་ནི་ནོར་གྱིས་སྡུད་པར་བྱེད།
en: He will attract them with his wealth.

source: །དེ་ནི་ནོར་དང་ལྡན་འགྱུར་ཞིང་།
en: He will be affluent

source: །དེ་ནི་བྱང་ཆུབ་སྤྱད་པ་སྤྱོད།
en: And engage in bodhisattva conduct.

source: །བློ་གྲོས་ཆེན་པོས་ས་འདི་ཀུན། །ཡོངས་སུ་བཏང་བ་བྱས་ནས་ཀྱང་།
en: “Through his great intelligence,

source: །དམན་པའི་སེམས་སུ་མི་འགྱུར་ཞིང་།
en: He will never adopt an inferior attitude

source: །གང་དག་བྱང་ཆུབ་མངོན་ཞུགས་པ།
en: “Whoever has entered the path of awakening

source: །དེ་དག་བུ་དང་བུ་མོ་དང་། །ཆུང་མ་དགེ་ཞིང་བཟང་མོ་དག །བཏང་ནས་མྱ་ངན་བྱེད་མི་འགྱུར།
en: Will not be saddened By giving away his sons or daughters, Or his virtuous and noble wife.

source: །དེ་ནི་སྔོན་དུ་འགྲོ་འགྱུར་ཞིང་།
en: “He will walk in front of others,

source: །བཀྲི་བ་མེད་ལ་མཐོང་ན་དགའ། །ཕྲག་དོག་དང་ནི་ང་རྒྱལ་གྱིས།
en: And delight those who lack guidance.

source: །ནམས་ཀྱང་དེ་ལ་གནོད་མི་འགྱུར།
en: But he will never be harmed By envy or pride.

source: །གང་དག་བྱང་ཆུབ་རབ་ཞུགས་པ།
en: “Whoever has entered the path of awakening

source: །དེ་དག་ཕྲག་དོག་མེད་ཅིང་དེས།
en: Will be free from envy and gentle.

source: །བཟོད་པའི་ཕ་རོལ་ཕྱིན་པར་འགྱུར།
en: He will perfect patience,

source: །ཕན་པ་འདོད་ཅིང་ཡོན་ཏན་ལྡན།
en: Be helpful, and possess excellent qualities.

source: །འཇིག་རྟེན་ཀུན་ན་དེ་རིན་ཆེན།
en: Are the most precious beings in the world.

source: །དེ་དག་འབྱུང་བ་ཤིན་ཏུ་དཀོན།
en: Such beings, who only rarely appear,

source: །དམད་པ་མེད་པའི་སྦྱིན་གནས་འགྱུར།
en: Are faultless objects of generosity.

source: །ས་འདི་དག་ནི་རིམ་གྱིས་སུ།
en: “The particles of earth

source: །བགྲང་བར་བྱ་ཞིང་དཔག་པར་ནུས།
en: Could gradually be counted and assessed,

source: །དེ་དག་རྣམས་ཀྱི་ཡོན་ཏན་མཐའ།
en: But the extent of such beings’ qualities

source: །ཚིག་གིས་བསྟན་པར་མི་ནུས་སོ།
en: Cannot be expressed in words.

source: །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ཀྱི།
en: “The minds of all sentient beings

source: །དུས་གསུམ་སེམས་ནི་ཤེས་པར་ནུས།
en: In the three times could be known.

source: །རྒྱ་མཚོ་ཆེན་པོ་བཞི་པོ་དག །སྐྲ་ནི་བྱེ་བ་སྟོང་གཤེགས་པའི། །སྐྲ་ཡིས་ཟད་པར་བྱ་བར་ནུས།
en: “The four great oceans Could eventually be depleted With a billionth part of a strand of hair,

source: །དེ་དག་ཡོན་ཏན་ཟད་མི་ནུས།
en: But such beings’ qualities can never be depleted. “One could count all the smallest particles of dust

source: །ས་རྣམས་ཐམས་ཅད་ཕྱེར་བརླགས་པ།
en: Created by grinding the entire earth into powder,

source: །རབ་ཏུ་ཕྲ་རྡུལ་ཤེས་པར་ནུས།
en: But the extent of the qualities

source: །སངས་རྒྱས་སྲས་པོ་དེ་དག་གི། །ཡོན་ཏན་མཐའ་ནི་བརྗོད་མི་ནུས།
en: Of these children of the buddhas cannot be expressed.

source: །ཆུ་ཀླུང་ཐམས་ཅད་རབ་འབབ་པ།
en: “It is possible for all the raging rivers

source: །རྒྱུན་ལས་ལྡོག་སྟེ་འགྲོ་ཡང་སྲིད། །སངས་རྒྱས་སྲས་པོ་དེ་དག་གི།
en: To reverse course and flow upstream,

source: །ཡོན་ཏན་མཐའ་བརྗོད་དེ་ལྟ་མིན།
en: But it is not possible to express the extent Of the qualities of these children of the buddhas.

source: །སྔོན་གྱི་ལུས་རྣམས་ཇི་སྙེད་པ།
en: Of all the sentient beings who have ever lived

source: །དེ་དག་ཡོན་ཏན་ཟད་མི་འགྱུར།
en: But there is no end to the qualities of these beings. “Even all the hairs that ever grew

source: །སྔོན་གྱི་ལུས་རྣམས་ཐམས་ཅད་ལ། །སྤུ་ཕྲེང་ཇི་སྙེད་ཡོད་པ་རྣམས།
en: On all their former bodies

source: །འགྲོ་བ་ལྔ་པོར་འཁོར་བ་ཡི། །སེམས་ཅན་ཀུན་གྱི་སྤུ་རྣམས་ནི།
en: Circle in the five classes of beings

source: །ས་འདི་ཇི་སྙེད་ཐམས་ཅད་པ།
en: “All the particles of earth

source: །ཆུ་ཡི་ཕུང་པོར་གནས་གྱུར་ཀྱང་།
en: Present in the oceans

source: །དེ་ནི་བགྲང་ཞིང་དཔག་པར་ནུས།
en: Could also be counted and assessed,

source: །དེ་དག་ཡོན་ཏན་བརྗོད་མི་ནུས།
en: But the qualities of these beings cannot be expressed.

source: །མར་མེ་མཛད་ནས་བཟུང་ནས་ནི།
en: “Starting from the time of Dīpaṃkara,

source: །མ་འོངས་བསྐལ་པ་ཇི་སྙེད་པ།
en: And for all the subsequent eons, One could know exhaustively

source: །དེ་ཡི་བར་དུ་ཤིང་ལྗོན་རྣམས།
en: All the fruits and flowers “Present on all the trees

source: །ཇི་སྙེད་མ་འོངས་འབྱུང་འགྱུར་བ།
en: That will ever grow. Yet the extent of the qualities

source: །དེ་དག་འབྲས་བུ་མེ་ཏོག་རྣམས།
en: Of these children of the buddhas cannot be expressed.

source: །དེ་དག་ཟད་པར་ཤེས་པར་ནུས། །བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་དང་། །ཁྲག་ཁྲིག་དག་ནི་བརྒྱ་བགྲངས་པར།
en: “They cannot be expressed,

source: །བརྩོན་པ་ཞིག་གིས་དེ་དག་གིས།
en: Even if a diligent person were

source: །བསྔགས་ཕྲེང་ཡིད་དུ་འོང་བརྗོད་ཀྱང་། །སངས་རྒྱས་སྲས་པོ་དེ་དག་གི། །ཡོན་ཏན་མཐའ་ནི་བརྗོད་མི་ནུས།
en: To sing them pleasing songs of praise

source: །སངས་རྒྱས་སྲས་པོ་དེ་དག་ལ།
en: For billions or trillions of eons.

source: །མི་གང་མི་དགའ་བྱེད་པ་དེ།
en: “Whoever displeases These children of the buddhas

source: །ལྷ་དང་མི་ནི་སྤངས་ནས་སུ།
en: Will depart the divine and human abodes,

source: །དེ་དག་དམྱལ་བ་སྤྱོད་ཡུལ་འགྱུར། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི།
en: And find themselves in the realms of hell.

source: །མི་གང་ལ་ལ་གནོད་བྱེད་པ།
en: “Whoever harms These bodhisattvas

source: །མིག་མེད་པའམ་ལོང་བ་དང་། །སྡུག་བསྔལ་དཔུང་གཉེན་མེད་པར་འགྱུར།
en: Will be born blind or without eyes, And will find no supportive friends when he suffers.

source: །ཤི་འཕོས་ནས་ནི་མནར་མེད་འགྲོ།
en: “After dying, he will go to the Hell of Ceaseless Torment,

source: །དེ་ནི་འབར་ཞིང་འཇིགས་སྐྲག་འགྱུར།
en: Where he will be burned and terrified.

source: །ལུས་ནི་ཆེན་པོར་གྱུར་ནས་ཀྱང་། །སྡུག་བསྔལ་ཚོར་བ་མྱོང་བར་འགྱུར།
en: He will also experience suffering When his body grows in size.

source: །ཚེ་རབས་དེ་དང་དེ་དག་ཏུ།
en: “Throughout his lives,

source: །དེ་ལུས་དཔག་ཚད་ཙམ་འགྱུར་ཏེ།
en: His body, which will remain a league in size,

source: །དེ་ལྟར་ཕྲུམ་ལྟར་ཟླུམ་གྱུར་ལ།
en: And be round like a curd ball,

source: །ཀུན་ནས་ཡོངས་སུ་བཟའ་བར་འགྱུར།
en: Will be eaten from all sides.

source: །དེ་ཚེ་ལུས་ལ་མགོ་བོ་ནི།
en: “At that time, his body will have

source: །ལྔ་སྟོང་ཡོད་པར་འབྱུང་འགྱུར་ཞིང་།
en: Five thousand heads,

source: །མགོ་བོ་དེ་དག་རེ་རེ་ལའང་།
en: And each of these heads

source: །ལྕེ་ནི་ལྔ་བརྒྱ་ཐམ་པ་ཡོད།
en: Will have five hundred tongues. “Each of these tongues will be plowed

source: །གཅིག་ལའང་ཐོང་གཤོལ་བརྒྱ་དག་གིས།
en: By hundreds of plowshares.

source: །ལྕེ་ནི་རབ་ཏུ་རྨོ་བར་འགྱུར། །སྡིག་པའི་ལས་ཀྱི་རྣམ་སྨིན་གྱིས། །མི་བཟད་ཆེན་པོར་གཤེགས་པར་འགྱུར།
en: Due to the ripening of his evil actions, His tongues will be slashed in unbearable ways.

source: །མནར་མེད་དེ་ནས་ཤི་འཕོས་ནས།
en: “After he dies and transfers from the Hell of Ceaseless Torment, This evil-minded person will then experience

source: །དེ་ནི་ཚ་དང་རབ་ཚ་བར། །བློ་གྲོས་ངན་པ་ཚོར་བ་མྱོང་།
en: The Hot and Fiercely Hot hells,

source: །དེ་སྔོན་ཉེས་བྱས་འབྲས་བུ་ཡིན།
en: As a result of his previous wrongdoings. “It is not rare for an unrestrained person

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི། །མ་བསྡམས་གང་ཞིག་གནོད་བྱེད་པ།
en: Who harms bodhisattvas

source: །དེ་ལ་དུད་འགྲོའི་སྐྱེ་གནས་དང་། །དམྱལ་བའི་ས་ནི་དཀོན་མ་ཡིན།
en: To be reborn in the animal realm, Or in the hell realms.

source: །ཚེ་རབས་བྱེ་བ་སྟོང་རྣམས་དང་། །ཁྲག་ཁྲིག་དག་ནི་བརྒྱ་བགྲངས་པར།
en: “For billions and Trillions of lives,

source: །སྡུག་བསྔལ་ཚོར་བ་མྱོང་འགྱུར་ཞིང་།
en: Such people experience suffering,

source: །དེ་ནི་བཟང་པོ་རྣམས་མི་མཐོང་།
en: And never encounter anything good.

source: །སངས་རྒྱས་སྲས་པོ་སྐྱོབས་རྣམས་ལ།
en: “Whoever harms the children of the buddhas,

source: །གནོད་པ་དག་ནི་བྱས་གྱུར་ན།
en: Who are the protectors,

source: །ཨ་ལ་གར་རྟ་འཇིགས་པ་ཡི།
en: Will be reborn as a water serpent—

source: །ཤིན་ཏུ་གདུག་པའི་སྦྲུལ་དུ་སྐྱེ།
en: Vicious and poisonous.

source: །དེ་ནི་བཀྲེས་དང་སྐོམ་པས་ཉེན།
en: “Tormented by hunger and thirst,

source: །སྡིག་པའི་ལས་རྣམས་བྱེད་པར་འགྱུར།
en: He will engage in evil deeds.

source: །དེ་ནི་ཟས་ཀྱང་མི་རྙེད་དེ།
en: Deprived of food,

source: །ནམས་ཀྱང་འགྲངས་པར་ཟ་མི་མྱོང་།
en: He will never feel satiated. “After he dies and transmigrates, he will be continuously crushed

source: །ཤི་འཕོས་གཤིན་རྗེའི་འཇིག་རྟེན་དུ། །དེ་ནི་རྟག་པར་གཏུན་དུ་བརྡུང་།
en: And beaten in the world of the Lord of Death.

source: །དགེ་སློང་དག་ལ་གནོད་བྱས་པས།
en: Because he has harmed monks,

source: །ནམས་ཀྱང་སྐབས་ནི་རྙེད་མི་འགྱུར།
en: He will never find any opportunity.

source: །དེ་ནས་ཤི་འཕོས་དུས་བྱས་ཏེ།
en: “Then, after he dies and transmigrates,

source: །མི་ཡི་ལུས་ནི་ཐོབ་གྱུར་ན།
en: If he obtains a human body,

source: །བློ་ངན་དེ་ནི་དམུས་ལོང་འགྱུར།
en: This evil-minded person will be blind,

source: །གནོད་སེམས་ལྡན་ཞིང་སྡོམ་པ་མེད།
en: Malicious, and unrestrained. “Because he has deprecated the noble ones

source: །དེ་ནི་ཉེས་པར་སྨྲས་བྱས་ཏེ། །འཕགས་པ་རྣམས་ལ་སྐུར་བཏབ་པས།
en: Using abusive words,

source: །ངན་སོང་དག་ཏུ་མྱུར་དུ་འགྲོ།
en: He will swiftly be reborn in the lower realms. “An unrestrained person

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི།
en: Who harms bodhisattvas

source: །མ་བསྡམས་གང་ཞིག་གནོད་བྱེད་པ།
en: Will not meet any buddha

source: །བསྐལ་པ་བྱེ་བ་སྟོང་དག་ཏུ། །ནམས་ཀྱང་སངས་རྒྱས་མཐོང་མི་འགྱུར།
en: For billions of eons.

source: །རྫོགས་སངས་རྒྱས་ཀྱི་སྲས་རྣམས་ལ།
en: “Whoever protects the children of the perfect buddhas,

source: །གང་ཞིག་ཆོས་བཞིན་སྲུང་བྱེད་པ།
en: In accordance with the Dharma,

source: །དེས་ནི་ངན་འགྲོ་ཀུན་སྤངས་ཏེ།
en: Will abandon all of the lower realms

source: །མྱུར་དུ་བཟང་འགྲོར་འགྲོ་བར་འགྱུར།
en: And swiftly proceed to the higher realms.

source: །ཕྱུག་ཅིང་ནོར་ཆེན་ལྡན་པ་དང་། །སྟོབས་དང་ལྡན་ཞིང་འཇིགས་པ་མེད།
en: “He will be wealthy, prosperous, Powerful, fearless,

source: །དྲན་དང་ལྡན་ཞིང་ཤེས་རབ་ལྡན།
en: Mindful, wise,

source: །བདེ་ཞིང་ངོ་ཚ་ཁྲེལ་ལྟས་ལྡན།
en: Happy, and endowed with self-respect and propriety. “Upon seeing the stūpa of a buddha,

source: །གང་དུ་འཇིག་རྟེན་རྣམས་ཀྱི་སྒྲོན།
en: Where a lamp of the worlds

source: །ཡོངས་སུ་མྱ་ངན་འདས་གྱུར་པ། །སངས་རྒྱས་མཆོད་རྟེན་མཐོང་ནས་ནི།
en: Has passed into parinirvāṇa,

source: །ཡང་དང་ཡང་དུ་བསྟི་སྟང་བྱེད། །རྫོགས་སངས་རྒྱས་ཀྱིས་གསུངས་པ་ཡི།
en: He will honor it again and again.

source: །འདི་འདྲའི་ཆོས་འདི་ཐོས་གྱུར་ནས།
en: “When hearing a Dharma discourse such as this

source: །སངས་རྒྱས་སྲས་པོ་རྣམས་ལ་ནི།
en: Spoken by the perfect buddhas,

source: །སུ་ཞིག་ཕྱི་ཕྱིར་དད་མི་བྱེད།
en: Who would not develop faith In the children of the buddhas? “One may venerate Myriads of buddhas

source: །གང་གིས་སངས་རྒྱས་སྟོང་རྣམས་དང་། །བརྒྱ་དང་བྱེ་བ་བགྲང་དག་ལ།
en: For as many eons as there are grains of sand

source: །བསྐལ་པ་གང་གཱའི་བྱེ་མ་སྙེད།
en: In the Ganges river.

source: །དེ་སྙེད་བསྐལ་པར་བཀུར་བ་བས།
en: “Yet, upholding the sacred Dharma, day and night,

source: །འཇིག་རྟེན་མགོན་གྱིས་གསུངས་པ་ཡི།
en: As it was revealed by the protectors of the world,

source: །དམ་ཆོས་འཇིག་ཚེ་གང་ཞིག་གིས། །ཉིན་དང་མཚན་དུ་འཛིན་བྱེད་པ།
en: When it is about to disappear,

source: །དེ་ནི་བསོད་ནམས་ཁྱད་པར་འཕགས།
en: Will accumulate much more merit.

source: །ཆོས་འཇིག་དུས་ན་ཆོས་འཛིན་པ།
en: “Whoever upholds the Dharma When it is about to disappear

source: །སྔོན་གྱི་སངས་རྒྱས་ཐམས་ཅད་དང་། །སངས་རྒྱས་ཡེ་ཤེས་རབ་གནས་པ། །ང་ལ་དེས་ནི་མཆོད་པ་བྱེད།
en: Will be worshiping me and all past buddhas, Who abide in awakened wisdom. “Whoever protects the doctrine of the Teacher

source: །དམ་པའི་ཆོས་ནི་འཇིག་པའི་ཚེ། །སྟོན་པའི་བསྟན་པ་སྲུང་བྱེད་པ།
en: When the sacred Dharma is about to disappear Will never be troubled

source: །བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་སུ། །དེ་ནི་ནམས་ཀྱང་རྒུད་མི་འགྱུར།
en: For billions of eons.

source: །ལུས་ཀྱིས་བདེ་བ་མྱོང་འགྱུར་ཞིང་།
en: “Such a person will find physical well-being

source: །དེ་ནི་ནད་ཀྱིས་བཏབ་མི་འགྱུར།
en: And will never be struck by illness.

source: །དེ་ནི་ཡིད་དུ་མི་འོང་བས།
en: Nor will he be thwarted

source: །ནམས་ཀྱང་འཕྲོགས་པར་མི་འགྱུར་རོ།
en: By unpleasant circumstances.

source: །སྟོན་པའི་བསྟན་པ་བསྲུང་བྱས་ན།
en: “Whoever protects the doctrine of the Teacher

source: །བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། །དེས་དང་གསལ་དང་མཉེན་པ་དང་། །སེམས་ཅན་རྣམས་ལ་བྱམས་སེམས་འགྱུར།
en: Will have perfect patience. He will be gentle, wise, and mild, And will be affectionate toward sentient beings.

source: །འཇིག་ཚེ་རྒྱལ་བ་མཆོག་གི་ཆོས་བཟུང་བས།
en: “Upholding the Dharma of the supreme Victor in a time of decline,

source: །བདེ་དང་དགའ་འཐོབ་མཛོད་ནི་མང་པོར་འགྱུར།
en: One will be happy and joyful, and one’s fortune will increase.

source: །སྔོན་གྱི་རིམ་གྲོ་བྱ་བ་འཐོབ་འགྱུར་ཞིང་།
en: One will reap the fruits of previous acts of veneration,

source: །མི་ཁོམ་བརྒྱད་པོ་མ་ལུས་ཟད་པར་སྤོང་།
en: And will abandon the eight unfree states entirely.

source: །དཔེར་ན་ནམ་མཁའ་སྐར་མས་ཡོངས་གང་ལྟར།
en: One will, just like the sky filled with stars,

source: །རྟག་ཏུ་མཚན་གྱིས་གོ་ཆར་བྱས་པ་དང་། །རབ་ཏུ་ཚིག་སྙན་ཡིད་འོང་དབྱངས་ལྡན་འགྱུར།
en: Always be adorned with the armor of the marks, And always speak pleasantly in a delightful voice.

source: །འཇིག་ཚེ་རྒྱལ་བ་མཆོག་གི་ཆོས་བཟུང་བས། །གང་ན་ཡིད་བདེ་མེད་ཅིང་རབ་སྡུག་པ།
en: “Upholding the Dharma of the supreme Victor in a time of decline,

source: །རིགས་དམན་དེ་ནི་དེ་ཡིས་སྤངས་པར་འགྱུར།
en: One will abandon birth in lowly castes

source: །ཕྱུག་ཅིང་ཤིན་ཏུ་བདེ་ལ་ལོངས་སྤྱོད་ལྡན།
en: Bereft of pleasure and filled with misery. Instead, one will be rich, happy, and fortunate.

source: །མཐུ་དང་སྟོབས་དང་ལྡན་ཞིང་བརྩོན་འགྲུས་ལྡན།
en: One will be powerful, strong, and diligent.

source: །མི་དམན་པ་རྣམས་ཀུན་ཏུ་རྣམ་པར་རྒྱུ།
en: One will always move among the superior,

source: །སངས་རྒྱས་བརྒྱ་སྟོང་དག་ལ་བསྙེན་བཀུར་བྱེད།
en: Venerating hundreds of thousands of buddhas.

source: །མཆོག་ཏུ་རབ་མཛེས་གཟུགས་ལྡན་ཤེས་རབ་ལྡན།
en: One will be born with a supremely attractive physical appearance.

source: །མི་ཡི་འཇིག་རྟེན་མཆོག་ཏུ་བསྙེན་བཀུར་འགྱུར།
en: One will be wise and supremely venerated in the human world,

source: །རྒྱལ་པོ་མཁས་པ་མཛངས་པ་རྣམས་ཀྱིས་བསྔགས།
en: Praised by kings, the learned, and the wise.

source: །མཆོག་ཏུ་གཟུགས་མཛེས་བལྟ་ན་སྡུག་པ་དང་། །སྐྱེས་པ་བུད་མེད་ལྷ་རྣམས་དགའ་བ་དང་། །བདེ་ཞིང་མཁས་པས་བསྔགས་ཤིང་ཤེས་རབ་ལྡན།
en: One will obtain a supremely beautiful and attractive appearance, And one will please and delight men, women, and gods. One will be praised by the wise and endowed with insight. “The person who is present before the Teacher—

source: །སྟོན་པ་སྟོབས་བཅུ་མངའ་བ་ལྷ་ཡི་ལྷས།
en: The god of gods, endowed with the ten powers—

source: །གང་གི་མདུན་དུ་མདོ་འདི་རབ་བཤད་པ།
en: As he expounds this sūtra

source: །མི་དེ་ལག་ཏུ་མདོ་སྡེ་འདི་འདྲ་འདི། །ཕྱི་མའི་དུས་ཀྱི་ཚེ་ན་ཐོབ་པར་འགྱུར།
en: Will, in the future, receive sūtras such as this directly. “Please listen as I now describe all the unique qualities

source: །གང་ཞིག་སྟོན་པ་མི་མཆོག་གཟུགས་བྱེད་པ།
en: That result from depicting the Teacher, the supreme human being,

source: །རས་འདྲི་རྩིག་ངོས་འདྲི་འམ་གསེར་ལས་བྱས། །དེ་ཡི་ཆོས་ཀྱི་ཁྱད་པར་གང་ཡིན་པ། །དེ་དག་མ་ལུས་རབ་ཏུ་བསྟན་གྱིས་ཉོན།
en: By painting his image on a cloth or the surface of a wall, Or by producing golden statues.

source: །དེ་ནི་བལྟ་མིན་ལོང་བར་གཞར་མི་འགྱུར།
en: “A person who engages in such practices will not be born blind,

source: །སྒུར་པོར་མི་འགྱུར་ཡན་ལག་མི་སྡུག་མིན།
en: Crooked, or with abnormal limbs.

source: །དེ་ནི་གཟུགས་དང་ལྡན་ཞིང་ཁ་དོག་ལྡན།
en: Blessed with an attractive appearance and good looks,

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་གྱིས་གོ་ཆར་འགྱུར།
en: He will possess the armor of the thirty-two marks.

source: །ལུས་ནི་རྣམ་པར་དག་ཅིང་ཁྱད་པར་འཐོབ།
en: “He will be born with a perfect and preeminent body;

source: །སྤོབས་པ་འཐོབ་ཅིང་སྒྲ་སྙན་ཡིད་དུ་འོང་།
en: He will be self-confident and speak with a pleasant voice.

source: །ཤེས་བཞིན་ལྡན་ཞིང་འཇིག་རྟེན་ཀུན་གྱི་གཙོ།
en: He will be attentive and will become the leader of the entire world.

source: །དེ་མཐོང་སེམས་ཅན་བདེ་ཞིང་དགའ་བར་འགྱུར།
en: Upon seeing him, others will be happy and joyful.

source: །སྡིག་བྱེད་མི་འགྱུར་ཞེ་སྡང་མེད་སེམས་ལྡན།
en: “He will not commit any evil, and his mind will be free from anger.

source: །གཡོ་མེད་མི་རྐུ་རྒྱལ་པོ་འཁྲུག་མི་བྱེད།
en: He will be honest and will neither steal nor quarrel with the king.

source: །མཐུ་དང་ལྡན་ཞིང་དབང་ཆེར་གྲག་པར་འགྱུར།
en: He will be renowned for his strength and power.

source: །བྱམས་ལ་གནས་ཤིང་མི་དམན་སེམས་དང་ལྡན།
en: He will be loving and have a superior mind.

source: །འདྲེན་པའི་སྐུ་གཟུགས་རབ་ཏུ་མཛེས་བྱས་ན།
en: “Whoever creates a beautiful image of the Guide

source: །དེ་ནི་མཆོག་འགྱུར་སྐྱེ་བོ་མང་མཆོད་འོས།
en: Will be supreme and fit to be worshiped by many beings.

source: །བློ་ལྡན་ཕྱུག་ཅིང་དེ་ཉིད་རྒྱ་ཆེར་ལྡན།
en: He will be intelligent, wealthy, prosperous,

source: །དབང་ལྡན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར།
en: And will become a powerful king, a universal monarch.

source: །ལྷ་ཡི་དབང་པོ་དབང་ཕྱུག་དབང་ཐོབ་པ།
en: Will obtain the power of the mighty lord of gods.

source: །ལྷུན་པོའི་ཟོམ་ན་དབང་ཐོབ་བརྒྱ་བྱིན་འགྱུར།
en: He will become Śakra, ruling on the summit of Mount Meru.

source: །བདག་པོ་ལྷུན་པོའི་ཟོམ་ན་རྒྱལ་སྲིད་སྟོན།
en: This lord will display his dominion on that summit.

source: །དེ་ནི་དྲན་དང་བློ་གྲོས་མི་ལྡན་མིན།
en: “Mindful and intelligent,

source: །དེ་ནི་རྟོགས་མོས་ཤེས་རབ་ཚང་བར་འགྱུར།
en: His understanding, dedication, and insight will be complete,

source: །འཇིག་རྟེན་ཀུན་ན་དབུགས་ཕྱིན་ཐོབ་འགྱུར་ཏེ།
en: And he will find relief in all the worlds.

source: །འདི་ནི་ཡེ་ཤེས་ལྡན་ཞིང་དམྱལ་བ་སྤངས།
en: This being will be endowed with wisdom and will abandon the hells.
